[[{"text": "Apply now! Senior Product Designer.\n\nTo apply, please click the link below"}, {"text": "Apply now! Blockchain Core Developer - Go, Solidity.\n\nInterested? Click the link to apply"}, {"text": "Get in touch! Product Director.\n\nInterested? Click the link to apply"}], [{"text": "Last month a group of our Nuneaton Distribution Centre colleagues supported their local community with a litter pick that covered nature reserves and parks in the Nuneaton area.\n\n11 people took part by using one of their two annual volunteer days that we provide to our colleagues for good causes of their choice.\n\nBen Hardcastle, Shift Manager, said: \"In total we managed to fill over 20 bags of litter from various sites. The team were approached by several members of the public and when we mentioned RS offering volunteer days they were extremely impressed.\n\n\"Working together to achieve a common goal is something we do every day at RS, but to give something back to the local community was especially rewarding.\"\n\nWell done everyone! We love seeing our people truly making amazing happen for a better world."}, {"text": "By 2026, Europe will have an EV charging station every 37 miles 🔌 🔋\n\nThe European Parliament and member states came to an agreement that will see European nations roll out electric and hydrogen charging points across the region over the next couple of years.\n\nThe end result will be an EV charging station every 37 miles (60 kilometers), according to a report by Bloomberg published on Tuesday.\n\nDo you own an EV? 🚙\n\nRead more via :\n\n➡️ ⬅️"}, {"text": "Discover how APC by Schneider Electric devices offer protection to data servers by exploring our interactive infographic.\n\n➡️ ⬅️"}], [{"text": "Cher reseau,\nJ’ai le plaisir de vous annoncer que j’occupe désormais le poste d'Apprenti Contrôleur de Gestion chez Capgemini !\n#capgemini #alternance #controledegestion"}, {"text": "🗣 [Concours d'éloquence Les Cicéronnades] 📢\n« Ich bin ein Berliner » 🇩🇪 assénait John F. Kennedy, en juin 1963, sous les applaudissements 👏 des Berlinois de l’Ouest, en plein blocus de Berlin. C’est en se faisant le relais des mots de l’un des présidents les plus éloquents de l’histoire des États-Unis qu’ obtient une récompense 🏅 aux Cicéronnades. Le bureau du recteur de l’académie d’Orléans-Tours l’invite à la remise des prix 👩‍🎓 qui aura lieu le 31 mai, lors d’un cocktail 🍸 en grandes pompes au Château de Chambord 🏰 !\n \nEstelle est étudiante en première année de  (Diplôme de Comptabilité et de Gestion) au lycée Louise Michel de Narbonne. Elle a participé au concours national d’éloquence en langue vivante étrangère, Les . Après une première étape cruciale du choix du texte à interpréter (sur le thème de la frontière cette année) les étudiants de DCG du Lycée Louise Michel volontaires ont bénéficié d’un cycle d’ateliers de prise de parole en public impulsé et mené par Marion Lopez-Burette. Travail sur le corps , sur la diction et sur la langue anglaise ainsi qu’entraînements aux techniques de prises de parole 🗣 en public ont clairement porté leurs fruits.\n \nLa prestation d’Estelle Camp témoigne à la fois de son travail et de l’intérêt qu’elle porte à la prise de parole. Le défi qu’elle a relevé prouve encore une fois l’importance pour l’ du futur de savoir communiquer et…pas qu’en français.\n \nDécidément, la filière du DCG à Louise Michel est complète, enrichissante et épanouissante ! 😁"}], [{"text": "Looking to start your business in 2023? Check out these top 5 business cities that are booming with opportunities and potential for growth.\n\nRemember, a strong business partner like Ampere can significantly help your journey. 🌟"}, {"text": "Are you considering setting up a business in the UK?\n\nThe definition of an LLC in the UK is more diverse than in other countries. The most popular form here is the Private Limited Company (Ltd). As a Limited Company, shareholders' liability is limited to the face value of their shares, providing a safety net for your personal assets.\n\nAnother option is the Public Limited Company (PLC), which has a share capital of over £50,000 and shares traded on the stock market. A minimum of two directors and a company secretary are required.\n\nLimited Liability Partnership (LLP) is yet another option. In this setup, partners are not liable for each other's actions, minimising shared liability.\n\nConsult with professionals to make an informed decision and start your journey towards a thriving business. Remember, setting up the right business structure can significantly impact your success! 🤝"}, {"text": "When setting up a business account in the UK, you might be asked to provide evidence of your establishment. Here's a rundown of the documents that will help ensure a smooth process:\n\n1️⃣ Proof of Residence: Utility bills, tenancy agreements, or official letters with your UK address.\n\n2️⃣ Certificate of Incorporation: A certificate of incorporation issued by Companies House is vital evidence for registered companies.\n\n3️⃣ Business Activities Details: These could be specific addresses, locations, or even virtual offices, if applicable.\n\n4️⃣ Staff and Work Details: Provide details of where your staff members are employed and the nature of their work within the business.\n\n5️⃣ Physical Premises: If you own or lease any physical premises related to your business operations, include these details too.\n\n6️⃣ Contracts, Orders, and Invoices: Providing details of contracts, orders, or invoices held or issued by your business will strengthen your case.\n\n7️⃣ Business Accounts Proof: This could be in the form of official financial statements.\n\nImportant Note: You need more than a UK VAT or UK Economic Operator Registration and Identification (EORI) number to prove your establishment in the UK.\n\nGather at least one of these documents, and the Ampere team will drive the process seamlessly. If you have any questions, don't hesitate to reach out!"}], [{"text": "iOS Developers this one is for you 📢\n\nFancy working on an App that won App of the Year, has 4.8 out of 5* from over 600k reviews and in the first 6 months of the year received 2.5million+ downloads! Then read on! 🚀\n\n🚀 HYBRID OR FULLY REMOTE - I’m currently working with one of the UK’s best-known eCommerce companies to help them find a Senior AND Mid-Level iOS Developer 🚀 (Must be UK based)\n\nHaving worked with this company over the last 5 years’ it has been amazing to watch them grow their Manchester and London HQ's as well as the impact they have had in supporting the engineering community 💫\n\nIf you want to be part of a highly innovative & Agile Tech team, where you'll have a massive impact and build products used by the whole of the UK and beyond then please get in touch!\n\nSenior: £85k + 25% Bonus + Medical + Dental and More!\n\nMid: £55k + 25% Bonus + Medical + Dental and More!"}], [{"text": "Aspire Systems helps organizations set up a complete end-to-end Quality Assurance Engineering (QAE) process that comprises innovative techniques and time-tested methodologies. Our team of test engineers & QA experts work to identify and mitigate risks, improve processes, and ensure that software meets customer expectations.\n\nCheck out how we help enterprises deliver quality software products with a faster time to market. -\n\n         "}, {"text": "Once again, we’ve made it happen. One of APAC's top urban transportation companies has been upgraded to provide a better user experience (UX) through ServiceNow's automation. The combined power of &  has positioned them as the most valuable players in accomplishing this remarkable feat. We're thrilled to share and - celebrate the significant  milestone with everyone!\n\n        "}, {"text": "Hold on to your hats, folks! 🎩 We've cooked up the MOST spontaneous Q&A of 2023 in our sizzling on-demand webinar! 🎥 No need to wait - we're unleashing the wildest ride in town of Instant Payments! ⏩ Join Now:\n\n, , , , \n\n "}], [{"text": "Unlocking employee energy beyond the workday: New research highlights the struggle of post-work exhaustion. Learn how organizations can promote recovery and support mental health. Discover effective solutions for a healthier work-life balance.\n\nRead more here -"}, {"text": "📊🔍 Unlocking Insights with Data Visualization! 🚀 Simplify complex data, accelerate decision-making, and discover hidden patterns. Dive into the power of visuals with #DataVisualization tools. 📈📊\n\nRead more here -"}, {"text": "Unleash the Power of Data-Driven Decisions!\nDive into Scottish Legal Aid Board (SLAB)'s digital transformation journey with SplashBI and discover how they transformed their Oracle reporting and analytics for improved insights and decisions.\n\nDownload the captivating case study now! \n\n\n  "}]]