[[{"text": "\"The best part is that I was able to wind down without having to rush back to anything\" - Technical Consulting Engineering intern, Ruffina Perlintina\n\nLearn how Ruffina utilizes her Cisco \"Day For Me\" to slow down and be grateful. ➡"}, {"text": "The new NFL season is here! To kick it off, join us for a conversation on how Cisco connects and protects the NFL from Draft to Super Bowl.\n \nIn this live event, Cathy Lanier, Chief Security Officer of the NFL, and Carrie Palin, SVP and Chief Marketing Officer for Cisco will discuss how the NFL and Cisco are partnering to create safe, secure, and unified fan experiences."}, {"text": "\"Cisco was like a wonderland to me, and I felt like a child in a candy store.\" - Technical Consulting Engineer, Yu Jie Lim\n\nWhat started as a dream became a reality for Yu Jie. Dive deeper into his career journey:"}], [], [{"text": "We are expanding our team and currently seeking a talented tech recruitment consultant! If you are interested, please send your CV to info@ventula.co.uk or apply directly through our website at ."}, {"text": "Given the fast-paced tech industry, how do you prefer to learn new skills?"}, {"text": "AI can improve efficiency by automating repetitive tasks, analyzing vast amounts of data with speed and accuracy, and optimizing processes for better decision-making.\n\nDo you think AI can be leveraged in the hiring process to reduce recruitment time?"}], [{"text": "MBDA's latest Sustainability Report is here! 📊\nGet ready to dive into our environmental, social, and governance (ESG) initiatives as we share our commitment to a sustainable future. 🌿🤝\n\nStay tuned for upcoming posts where we'll provide an in-depth look at our progress in 2022 and our plans ahead. 🚀\nLearn more about our sustainability journey:"}, {"text": "In our #MBDAInnovationLab each one of our thousands of employees is invited to join in and propose their ideas! Thus, 40 selected projects each year come to life helping MBDA to stay in the front line of innovative companies. Innovation Lab functions like an incubator!\n\nThe projects strengthen collaboration and a spirit of audacity within MBDA.\nLet’s see what Nicolas from MBDA France has experienced in Innovation Lab.\n \nLearn more about Innovation Lab:"}, {"text": "In our #MBDAInnovationLab each one of our thousands of employees is invited to join in and propose their ideas!\nThus, 40 selected projects each year come to life helping MBDA to stay in the front line of innovative companies. \nInnovation Lab functions like an incubator!\n\nThe projects strengthen collaboration and a spirit of audacity within MBDA.\nLet’s see what Charline from MBDA France has experienced in Innovation Lab.\n\nLearn more:"}], [{"text": "A good refresher on testing for the weekend.\n\n#keeplearning #frontenddeveloper #webdeveloper      "}, {"text": "This seems like a pretty good alternative to well-established apps like CodePen or Repl.it. You can't save your progress, but it's quick and easy, and the UI looks pretty good.\n\n        "}, {"text": "I recently had to switch to Windows for a project and I was looking for a better terminal for Windows. Tabby seems like it might do the job. What other tools are you using on Windows?\n\n        "}], [{"text": "Mark Hurren is working on a 3rd line / Sys Admin role for an on-premise organisation now undertaking a number of projects, with no plans to move to Cloud servers either so the combination of their work sector and IT strategy offers security and the chance to get your hands dirty in the server room, rather than be sat talking to AWS or Microsoft.\n\nHybrid working in Suffolk. Interested parties should drop Mark a message. 👍"}, {"text": "We're #hiring a new Business Intelligence Developer in Ipswich, England. Apply today or share this post with your network."}, {"text": "We're #hiring a new Systems Administrator in Ipswich, England. Apply today or share this post with your network."}], [{"text": "BI Developer – SSIS, SSRS, SSAS - £40,000 to £50,000 - Hybrid - Ipswich (3 days a Week) – Ref: J549610\n\nWe have a new opportunity for a BI Developer to join a well-established business in Ipswich who operate all around the world. Working as part of the Business Intelligence team, the BI Developer will be responsible for the development and maintenance of their data warehouse solutions as well as building planned and ad hoc reports. This will involve coordinating with key contacts to improve business data for business insights.\n \nWe are looking for a seasoned BI Developer with solid experience of the Microsoft BI suite (SSIS, SSRS and SSAS). You should be able to demonstrate experience with integrating data from various data sources as well as designing and implementing DWH (Data Warehouses) using ETL tools.\n\nYou should be comfortable using T-SQL or SQL for things like Stored procedures, Views, Functions, Synonyms and indexes.\n\nExperience of working with one or more of the following Data Visualisation tools is required: QlikView, Qlik Sense knowledge using Power BI or Tableau.\n \nFor more information, please contact Michael Johnson of Hurren and Hope via or on 01473 599 009."}, {"text": "Lead PHP Developer – Agency, WordPress – Remote (UK Based) / Birmingham - £55,000 to £65,000 – Ref: J556440\n \nWe have a new opportunity for a Lead PHP Developer to join a well-established and Niche Agency in Birmingham. We are looking for someone who has previous experience of implementing best practices for things like documentation, CI/CD, Pair Programming, TDD and generally empowering the backend development team and associated partners.\n \nThis is a hands-on role with 40% of your time creating best practices. The other 60% will focused on day to day development tasks. This is more of a tech lead, as opposed to a team lead, where you will be instrumental in ensuring they continue to delivery high quality digital solutions to their clients / partners.\n \nSkills, knowledge and experience required:\n\n·        You must have a solid, stable work history building digital solutions in PHP and WordPress\n·        You must have a deep understanding of CRM’S\n·        You will have demonstrable experience of creating / implemented best practices as part of a team / project\n·        Experience of building solutions on cloud-based platforms like AWS is highly desirable.\n\nThe role is remote first, but they do try and get together once a quarter for socials in Birmingham. This is a desirable “non-essential” requirement.\n\nFor more information, please contact Michael Johnson of Hurren and Hope via or on 020 3833 0334."}, {"text": "Senior DevOps Engineer / Lead – Azure, Cyber Security – Remote (UK Based) / London - £90,000 to £115,000 – Ref: J557757\n \nWe have a new opportunity for a Senior DevOps Engineer / Lead to join a Cyber Security scale-up. The successful candidate will have come from a Software Engineering background with a real passion for DevOps, Automation and Everything-as-code.\n\nWe are looking for someone who has aspirations of moving into a team lead role managing a small group of DevOps Engineers. You may not be ready for leadership now, but in the next 6 to 12 months you should have the desire to go in that direction.\n\nAny prior experience of leading DevOps Engineers in objective setting or carrying out 121’s / appraisals will be looked upon favourably. When you are established, your time will be split 70% hands on with the remaining 30% dealing with leadership tasks.\n\nSkills, knowledge and experience required:\n\n·        You will ideally be degree educated in a relevant discipline and have a good few years commercial experience in a DevOps role utilising Azure\n·        You must have a desire to take on a lead role, ideally with some prior experience of objective setting or carrying out 121’s / appraisals\n·        You must have a good understanding of Software Engineering where you have either studied or started out working as a Software Engineer using languages like C#, C++, Python, Java ETC\n·        Must be comfortable building CI/CD Pipelines from scratch\n·        Good exposure to IaC (Terraform, Ansible) and Containerised technologies like Kubernetes.\n·        Excellent communication skills with the ability to communicate with people at all levels of experience are a must for this role\n\nThis is a remote first role, but we do need the successful candidate to be based within the UK and have full right to work.\n\nFor more information, please contact Michael Johnson of Hurren and Hope via or on 020 3833 0334."}, {"text": "C++ Software Engineer / Lead – Cyber Security – Remote (UK Based) / London - £60,000 to £75,000 – Ref: J556440\n \nWe have a new opportunity for a Mid or Senior C++ Software Engineer to join a Cyber Security scale-up. We are looking for someone who has aspirations of moving into a team lead role managing a small group of 3 to 4 Engineers. You may not be ready for leadership now, but in the next 12 months you should have the desire to go in that direction. Any prior experience of leading small teams, projects or scrum ceremonies, will be looked upon favourably.\n\nThe C++ Software Engineer will be joining the Core Software Development team, where you will be responsible for architecting, designing and developing highly scalable, complex real time (multi-threaded / multi-processing) solutions in C++. You will also help drive the adoption of TDD and other best practices.\n\nSkills, knowledge and experience required:\n\n·        You will ideally be degree educated in a relevant discipline and have good commercial experience in architecting, designing and developing highly scalable, complex real-time solutions using C++\n·        You must have a desire to take on a lead role, ideally with some prior experience of leading projects and / or scrum meetings\n·        Prior experience of TDD and working in Agile environments is also a must for this role\n\nThe role is remote first, but we do need the successful candidate to be based within the UK and have full right to work.\n\nFor more information, please contact Michael Johnson of Hurren and Hope via or on 020 3833 0334."}], [{"text": "The UK Government has today published a Biomass Strategy which sets out its position on the use of #biomass in the UK’s plans for delivering #netzero. 🌿\n\nWe welcome their clear support for sustainably sourced biomass and the critical role that can play in achieving the country’s climate goals, and we’re looking forward to working alongside the Government to ensure biomass is best used to contribute to net zero across the economy. ⚡ 🌍\n\n👉 Read more in this article from our CEO, : \n\n🗞️ Plus, read our RNS:"}, {"text": "New exciting opportunities in IT, as Caroline Bedford, our Head of Group IT Operations, is building a global, single Service Desk!\n\nWe'll be posting about 8 fantastic opportunities in the next few weeks, here's the first:\n\n📌 Senior IT Service Desk Analyst (Selby, UK)\n\n\nFor an informal chat, contact the Resourcing Business Partner looking after this role.\n\n   "}, {"text": "Aidan Kerr, our Media Manager, is looking for a Communications Officer (12-months FTC) to join his team.\n\nCombine your passion for news and current affairs with sustainability. Read more about this opportunity here:\n\n\nFor an informal chat, contact  our Resourcing Specialist looking after this role."}]]